rheoTool/tutorials/rheoHeatFoam/OtherTests/cavity/Newtonian/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(

  (0 0 -0.5)
  (1 0 -0.5)
  (1 1 -0.5)
  (0 1 -0.5)

  (0 0 0.5)
  (1 0 0.5)
  (1 1 0.5)
  (0 1 0.5)
 
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (127 127 1) simpleGrading (1 1 1) //0
);

edges
(
);

boundary
(
   
   movingLid
     {
        type wall;
        faces
        (
            (3 2 6 7)            
        );
    }
    
    fixedWalls
    {
        type wall;
        faces
        (
            (0 3 7 4)
            (0 1 5 4)
            (5 6 2 1)            
        );
    }    
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 2 3) 
            (4 5 6 7)           
        );
    }
  
);

mergePatchPairs
(
);

// ************************************************************************* //
